# RT-DETR-r18 MultiModal with CAFM Fusion (Optimized)
# 
# CAFM优化使用策略：
#   - P3跨模态融合：CAFM_Fusion（RGB ↔ 红外交叉注意力）
#   - Head FPN/PAN：Concat（融合后特征，单模态内部）
#
# ═══════════════════════════════════════════════════════════
# 设计理念修正
# ═══════════════════════════════════════════════════════════
#
# 【问题】原版将CAFM应用到所有融合点导致冗余
#   - P3融合后，所有特征都来自同一融合流
#   - FPN/PAN的融合不再是跨模态，而是单模态不同尺度
#   - 过度使用CAFM增加计算量，收益有限
#
# 【解决】CAFM只用于真正的跨模态融合点
#   位置①：P3跨模态融合 → CAFM_Fusion（RGB_P3 + X_P3）
#   其他：FPN/PAN所有点 → 简单Concat
#
# ═══════════════════════════════════════════════════════════
# 层号索引（共38层，0-37）
# ═══════════════════════════════════════════════════════════
#
# ─── RGB分支 ───
#   0-3   RGB Stem
#   4-5   RGB Stage2-3
#   6-7   RGB Stage4-5
#
# ─── 红外分支 ───
#   8-11  X Stem
#   12-13 X Stage2-3
#   14-15 X Stage4-5
#
# ─── Backbone融合 ───
#   16    CAFM_Fusion P3 ← RGB_P3 + X_P3  ★唯一CAFM使用点
#   17    Blocks P4/16
#   18    Blocks P5/32
#
# ─── Head（全部使用Concat）───
#   19-21 Encoder
#   22-23 FPN P5→P4 (Concat)
#   24-27 FPN P4→P3 (Concat)
#   28-30 PAN P3→P4 (Concat)
#   31-33 PAN P4→P5 (Concat)
#   34    RTDETRDecoder
#
# ═══════════════════════════════════════════════════════════

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:

  # ══════════════════════════════════════════════════════════
  # RGB分支 - ResNet18
  # ══════════════════════════════════════════════════════════
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']  # 0-P1/2 RGB输入
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]         # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]         # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                                # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                 # 4 RGB Stage2
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]                # 5-P3/8 RGB_P3 128ch
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]                # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]                # 7-P5/32

  # ══════════════════════════════════════════════════════════
  # 红外(X)分支 - ResNet18
  # ══════════════════════════════════════════════════════════
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']    # 8-P1/2 红外输入
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]         # 9
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]         # 10
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                                # 11-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                 # 12 X Stage2
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]                # 13-P3/8 X_P3 128ch
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]                # 14-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]                # 15-P5/32

  # ══════════════════════════════════════════════════════════
  # ★唯一CAFM使用点 - P3跨模态融合
  # ══════════════════════════════════════════════════════════
  # 输入：RGB_P3(层5-128ch) + X_P3(层13-128ch)
  # 输出：256ch融合特征
  # 机制：通道描述子交叉注意力 → RGB↔红外互相增强 → 空间注意力精炼
  - [[5, 13], 1, CAFM_Fusion, [256]]                                # 16-P3/8 跨模态融合

  # ══════════════════════════════════════════════════════════
  # 融合后继续处理 P4/P5（已经是单模态特征流）
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]                # 17-P4/16 256ch
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]                # 18-P5/32 512ch

head:

  # ══════════════════════════════════════════════════════════
  # Encoder部分
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 19 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]                                        # 20 编码器
  - [-1, 1, Conv, [256, 1, 1]]                                      # 21 Y5, lateral_convs.0

  # ══════════════════════════════════════════════════════════
  # FPN上采样路径 - 使用简单Concat（融合后特征，非跨模态）
  # ══════════════════════════════════════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      # 22 P5上采样
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 23 input_proj.1 (P4)
  - [[-2, -1], 1, Concat, [1]]                                      # 24 Concat（非CAFM）
  - [-1, 3, RepC3, [256, 0.5]]                                      # 25 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                                      # 26 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      # 27 P4上采样
  - [16, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 28 input_proj.0 (融合P3)
  - [[-2, -1], 1, Concat, [1]]                                      # 29 Concat（非CAFM）
  - [-1, 3, RepC3, [256, 0.5]]                                      # 30 X3, fpn_blocks.1

  # ══════════════════════════════════════════════════════════
  # PAN下采样路径 - 使用简单Concat
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                                      # 31 downsample_convs.0
  - [[-1, 26], 1, Concat, [1]]                                      # 32 Concat（非CAFM）
  - [-1, 3, RepC3, [256, 0.5]]                                      # 33 F4, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]                                      # 34 downsample_convs.1
  - [[-1, 21], 1, Concat, [1]]                                      # 35 Concat（非CAFM）
  - [-1, 3, RepC3, [256, 0.5]]                                      # 36 F5, pan_blocks.1

  # ══════════════════════════════════════════════════════════
  # RTDETRDecoder检测头
  # ══════════════════════════════════════════════════════════
  - [[30, 33, 36], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]       # 37 Detect(P3, P4, P5)