# RT-DETR MultiModal with Dual Backbone (C2f + HGBlock) + HAFB Fusion
# 
# 双骨干网络多模态架构：
#   - RGB分支：C2f轻量路径
#   - 红外分支：HGBlock重量路径
#   - HAFB：每个尺度融合两路特征
#
# ═══════════════════════════════════════════════════════════
# 架构设计理念
# ═══════════════════════════════════════════════════════════
#
# 【双骨干异构设计】
#   RGB路径（轻量）：HGStem → C2f → Conv下采样
#   红外路径（重量）：HGStem → HGBlock → DWConv下采样
#   原因：RGB信息丰富用轻量网络，红外信息稀疏用重量网络
#
# 【HAFB三尺度融合】
#   P3融合：层15 = RGB_P3(层7) + X_P3(层14)
#   P4融合：层30 = RGB_P4(层20) + X_P4(层29)
#   P5融合：层41 = RGB_P5(层34) + X_P5(层40)
#
# ═══════════════════════════════════════════════════════════
# 层号索引（共43层，0-42）
# ═══════════════════════════════════════════════════════════
#
# ─── RGB分支（C2f轻量路径）───
#   0    HGStem [16, 32]  RGB输入
#   1    C2f [32]  P2/4
#   2    Conv [64, 3, 2]  下采样
#   3    C2f [64]  P3/8 RGB路径第一个关键特征
#   4    Conv [128, 3, 2]  下采样
#   5    C2f [128]  P4/16
#   6    Conv [256, 3, 2]  下采样
#   7    C2f [256]  P5/32 RGB路径最终特征
#
# ─── 红外分支（HGBlock重量路径）───
#   8    HGStem [16, 32]  红外输入
#   9    HGBlock [16, 32, 3]  P2/4
#   10   DWConv [64, 3, 2]  下采样
#   11   HGBlock [32, 64, 3]  P3/8 第一层
#   12   HGBlock [32, 64, 3]  P3/8 第二层
#   13   HGBlock [32, 64, 3]  P3/8 第三层
#   14   HGBlock [32, 64, 3]  P3/8 红外路径第一个关键特征
#
#   15   HAFB P3融合 [64, True]  ← RGB_P3(层3) + X_P3(层14)
#
#   16   DWConv [128, 3, 2]  红外下采样
#   17   HGBlock [64, 128, 5, True, False]  P4/16 第一层
#   18   HGBlock [64, 128, 5, True, True]  P4/16 第二层
#   19   HGBlock [64, 128, 5, True, True]  P4/16 第三层
#
#   20   Conv [128, 3, 2]  RGB从P3下采样到P4
#   21   C2f [128]  RGB P4增强
#   22-28 [预留层号空间]
#   29   HGBlock [64, 128, 5, True, True]  红外P4最终特征
#
#   30   HAFB P4融合 [128, False]  ← RGB_P4(层21) + X_P4(层29)
#
#   31   DWConv [256, 3, 2]  红外下采样
#   32   HGBlock [128, 256, 5, True, False]  P5/32 第一层
#   33   HGBlock [128, 256, 5, True, False]  P5/32 第二层
#
#   34   Conv [256, 3, 2]  RGB从P4下采样到P5
#   35   C2f [256]  RGB P5第一层
#   36   C2f [256]  RGB P5第二层
#   37   C2f [256]  RGB P5第三层
#   38-39 [预留]
#   40   HGBlock [128, 256, 5, True, False]  红外P5最终特征
#
#   41   HAFB P5融合 [256, False]  ← RGB_P5(层37) + X_P5(层40)
#
# ─── Head部分 ───
#   42   Conv input_proj.2
#   43   AIFI
#   44   Conv Y5
#   45-57 FPN/PAN标准结构
#   58   RTDETRDecoder
#
# ═══════════════════════════════════════════════════════════

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:

  # ══════════════════════════════════════════════════════════
  # RGB分支 - C2f轻量路径
  # ══════════════════════════════════════════════════════════
  - [-1, 1, HGStem, [16, 32], 'RGB']                                # 0-P2/4 RGB输入
  - [0, 1, C2f, [32]]                                               # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]]                                       # 2-P3/8 下采样
  - [-1, 1, C2f, [64]]                                              # 3-P3/8 RGB第一关键特征
  
  - [-1, 1, Conv, [128, 3, 2]]                                      # 4-P4/16 下采样
  - [-1, 1, C2f, [128]]                                             # 5-P4/16
  
  - [-1, 1, Conv, [256, 3, 2]]                                      # 6-P5/32 下采样
  - [-1, 3, C2f, [256]]                                             # 7-P5/32 RGB最终特征

  # ══════════════════════════════════════════════════════════
  # 红外(X)分支 - HGBlock重量路径
  # ══════════════════════════════════════════════════════════
  - [-1, 1, HGStem, [16, 32], 'X']                                  # 8-P2/4 红外输入
  - [8, 3, HGBlock, [16, 32, 3]]                                    # 9-P2/4 HGBlock堆叠
  - [-1, 1, DWConv, [64, 3, 2, 1, False]]                           # 10-P3/8 下采样
  - [-1, 3, HGBlock, [32, 64, 3]]                                   # 11-P3/8 第一层
  - [-1, 3, HGBlock, [32, 64, 3]]                                   # 12-P3/8 第二层
  - [-1, 3, HGBlock, [32, 64, 3]]                                   # 13-P3/8 第三层
  - [-1, 3, HGBlock, [32, 64, 3]]                                   # 14-P3/8 红外第一关键特征

  # ══════════════════════════════════════════════════════════
  # ★HAFB P3融合
  # ══════════════════════════════════════════════════════════
  # 输入：RGB_P3(层3) + X_P3(层14)
  # 参数：[out_channels, use_higher_order]
  #   - use_higher_order=True: P3使用高阶注意力（特征层次浅）
  - [[3, 14], 1, HAFB, [64, True]]                                  # 15-P3/8 融合特征

  # ══════════════════════════════════════════════════════════
  # 红外继续向P4推进
  # ══════════════════════════════════════════════════════════
  - [15, 1, DWConv, [128, 3, 2, 1, False]]                          # 16-P4/16 从融合P3下采样
  - [-1, 3, HGBlock, [64, 128, 5, True, False]]                     # 17-P4/16 第一层 (light=True, shortcut=False)
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 18-P4/16 第二层
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 19-P4/16 第三层

  # ══════════════════════════════════════════════════════════
  # RGB继续向P4推进
  # ══════════════════════════════════════════════════════════
  - [15, 1, Conv, [128, 3, 2]]                                      # 20-P4/16 从融合P3下采样
  - [-1, 1, C2f, [128]]                                             # 21-P4/16 RGB P4增强
  
  # 红外P4继续堆叠
  - [19, 3, HGBlock, [64, 128, 5, True, True]]                      # 22-P4/16 第四层
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 23-P4/16 第五层
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 24-P4/16 第六层
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 25-P4/16 第七层
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 26-P4/16 第八层
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 27-P4/16 第九层
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 28-P4/16 第十层
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]                      # 29-P4/16 红外P4最终特征

  # ══════════════════════════════════════════════════════════
  # ★HAFB P4融合
  # ══════════════════════════════════════════════════════════
  # 输入：RGB_P4(层21) + X_P4(层29)
  # 参数：use_higher_order=False (P4特征层次较深，用标准融合)
  - [[21, 29], 1, HAFB, [128, False]]                               # 30-P4/16 融合特征

  # ══════════════════════════════════════════════════════════
  # 红外继续向P5推进
  # ══════════════════════════════════════════════════════════
  - [30, 1, DWConv, [256, 3, 2, 1, False]]                          # 31-P5/32 从融合P4下采样
  - [-1, 3, HGBlock, [128, 256, 5, True, False]]                    # 32-P5/32 第一层
  - [-1, 3, HGBlock, [128, 256, 5, True, False]]                    # 33-P5/32 第二层

  # ══════════════════════════════════════════════════════════
  # RGB继续向P5推进
  # ══════════════════════════════════════════════════════════
  - [30, 1, Conv, [256, 3, 2]]                                      # 34-P5/32 从融合P4下采样
  - [-1, 3, C2f, [256]]                                             # 35-P5/32 第一层
  - [-1, 3, C2f, [256]]                                             # 36-P5/32 第二层
  - [-1, 3, C2f, [256]]                                             # 37-P5/32 RGB P5最终特征

  # 红外P5继续堆叠
  - [33, 3, HGBlock, [128, 256, 5, True, False]]                    # 38-P5/32 第三层
  - [-1, 3, HGBlock, [128, 256, 5, True, False]]                    # 39-P5/32 第四层
  - [-1, 3, HGBlock, [128, 256, 5, True, False]]                    # 40-P5/32 红外P5最终特征

  # ══════════════════════════════════════════════════════════
  # ★HAFB P5融合
  # ══════════════════════════════════════════════════════════
  # 输入：RGB_P5(层37) + X_P5(层40)
  # 参数：use_higher_order=False (P5特征层次最深)
  - [[37, 40], 1, HAFB, [256, False]]                               # 41-P5/32 融合特征

head:

  # ══════════════════════════════════════════════════════════
  # Encoder部分
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 42 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]                                        # 43 编码器
  - [-1, 1, Conv, [256, 1, 1]]                                      # 44 Y5, lateral_convs.0

  # ══════════════════════════════════════════════════════════
  # FPN上采样路径
  # ══════════════════════════════════════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      # 45
  - [30, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 46 input_proj.1 (融合P4)
  - [[-2, -1], 1, Concat, [1]]                                      # 47
  - [-1, 3, RepC3, [256, 0.5]]                                      # 48 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                                      # 49 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      # 50
  - [15, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 51 input_proj.0 (融合P3)
  - [[-2, -1], 1, Concat, [1]]                                      # 52 cat backbone P3
  - [-1, 3, RepC3, [256, 0.5]]                                      # 53 X3, fpn_blocks.1

  # ══════════════════════════════════════════════════════════
  # PAN下采样路径
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                                      # 54 downsample_convs.0
  - [[-1, 49], 1, Concat, [1]]                                      # 55 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]                                      # 56 F4, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]                                      # 57 downsample_convs.1
  - [[-1, 44], 1, Concat, [1]]                                      # 58 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]                                      # 59 F5, pan_blocks.1

  # ══════════════════════════════════════════════════════════
  # RTDETRDecoder检测头
  # ══════════════════════════════════════════════════════════
  - [[53, 56, 59], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]       # 60 Detect(P3, P4, P5)