# RT-DETR-r18 MultiModal with C2f_DCMB + HyperACE + FullPAD_Tunnel
# 
# 将单模态创新点适配到双模态架构：
#   - C2f_DCMB：动态递增混合块，替换Backbone中的BasicBlock
#   - HyperACE：超图自适应关联增强，用于多尺度特征聚合
#   - FullPAD_Tunnel：门控特征直通旁路，防止信息衰减
#
# ═══════════════════════════════════════════════════════════
# 创新点位置说明
# ═══════════════════════════════════════════════════════════
#
# 【C2f_DCMB位置】
#   - 层8-9：RGB分支 Stage2-3（替换BasicBlock）
#   - 层10-11：红外分支 Stage2-3（替换BasicBlock）
#   - 层14：融合后P4阶段增强
#   - 层15：融合后P5阶段增强
#
# 【HyperACE位置】
#   - 层21：FPN P5→P4聚合（输入：融合P3 + P4 + P5上采样）
#     替换原本的简单Concat，实现三尺度超图建模
#
# 【FullPAD_Tunnel位置】
#   - 层23：FPN P4旁路（HyperACE输出 → RepC3 → Tunnel）
#   - 层29：FPN P3旁路（融合P3 → RepC3 → Tunnel）
#   - 层33：PAN P4旁路（PAN RepC3 → Tunnel）
#   - 层37：PAN P5旁路（PAN RepC3 → Tunnel）
#
# ═══════════════════════════════════════════════════════════

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ══════════════════════════════════════════════════════════
  # RGB分支 - 红外分支双路处理
  # ══════════════════════════════════════════════════════════
  
  # RGB Stem
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']  # 0-P1/2 RGB输入
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]         # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]         # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                                # 3-P2/4
  
  # 红外(X) Stem
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']    # 4-P1/2 红外输入
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]         # 5
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]         # 6
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                                # 7-P2/4
  
  # ══════════════════════════════════════════════════════════
  # ★创新点① C2f_DCMB - RGB分支Stage2-3
  # ══════════════════════════════════════════════════════════
  # 替换原版：Blocks [64, BasicBlock, 2, 2, 'relu']
  # 动态递增混合块增强RGB特征提取
  - [3, 2, C2f_DCMB, [64]]                                          # 8-RGB Stage2
  - [-1, 3, C2f_DCMB, [128]]                                        # 9-RGB P3/8
  
  # ══════════════════════════════════════════════════════════
  # ★创新点① C2f_DCMB - 红外分支Stage2-3
  # ══════════════════════════════════════════════════════════
  # 替换原版：Blocks [64, BasicBlock, 2, 2, 'relu']
  # 动态递增混合块增强红外特征提取
  - [7, 2, C2f_DCMB, [64]]                                          # 10-X Stage2
  - [-1, 3, C2f_DCMB, [128]]                                        # 11-X P3/8
  
  # ══════════════════════════════════════════════════════════
  # P3中层融合点
  # ══════════════════════════════════════════════════════════
  - [[9, 11], 1, Concat, [1]]                                       # 12-Concat RGB P3 + X P3
  - [-1, 1, Conv, [256, 1, 1]]                                      # 13-融合卷积 256ch
  
  # ══════════════════════════════════════════════════════════
  # ★创新点① C2f_DCMB - 融合后P4/P5继续增强
  # ══════════════════════════════════════════════════════════
  - [-1, 3, C2f_DCMB, [256]]                                        # 14-P4/16 (替换BasicBlock)
  - [-1, 3, C2f_DCMB, [512]]                                        # 15-P5/32 (替换BasicBlock)

head:
  # ══════════════════════════════════════════════════════════
  # Encoder部分
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 16-input_proj.2
  - [-1, 1, AIFI, [1024, 8]]                                        # 17-编码器
  - [-1, 1, Conv, [256, 1, 1]]                                      # 18-Y5, lateral_convs.0

  # ══════════════════════════════════════════════════════════
  # FPN上采样路径
  # ══════════════════════════════════════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      # 19
  - [14, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 20-input_proj.1 (P4)
  
  # ══════════════════════════════════════════════════════════
  # ★创新点② HyperACE - 三尺度超图聚合
  # ══════════════════════════════════════════════════════════
  # 输入：融合P3(层13) + P4(层20) + P5上采样(层19)
  # 参数：[out_channels, num_hyperedges, dsc3k, shortcut, e1, e2, context]
  #   - num_hyperedges=8：超边数量
  #   - dsc3k=True：低阶分支使用DSC3k
  #   - shortcut=True：DSBottleneck使用shortcut
  #   - e1=0.5：主通道扩展比例
  #   - e2=1：C3AH内部扩展比例
  #   - context="both"：C3AH同时使用全局和局部上下文
  - [[13, 20, 19], 1, HyperACE, [256, 8, True, True, 0.5, 1, "both"]]  # 21
  
  - [-1, 3, RepC3, [256, 0.5]]                                      # 22-fpn_blocks.0
  
  # ══════════════════════════════════════════════════════════
  # ★创新点③ FullPAD_Tunnel - FPN P4旁路
  # ══════════════════════════════════════════════════════════
  # 输入：[RepC3输出(层22), HyperACE原始输出(层21)]
  # 门控融合：output = RepC3 + gate * HyperACE
  - [[-1, 21], 1, FullPAD_Tunnel, []]                               # 23
  
  - [-1, 1, Conv, [256, 1, 1]]                                      # 24-Y4

  # ══════════════════════════════════════════════════════════
  # FPN P4→P3
  # ══════════════════════════════════════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      # 25
  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 26-input_proj.0 (融合P3)
  - [[-2, -1], 1, Concat, [1]]                                      # 27-cat Y4 + 融合P3
  - [-1, 3, RepC3, [256, 0.5]]                                      # 28-fpn_blocks.1
  
  # ══════════════════════════════════════════════════════════
  # ★创新点③ FullPAD_Tunnel - FPN P3旁路
  # ══════════════════════════════════════════════════════════
  - [[-1, 26], 1, FullPAD_Tunnel, []]                               # 29

  # ══════════════════════════════════════════════════════════
  # PAN下采样路径 P3→P4
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                                      # 30-downsample_convs.0
  - [[-1, 24], 1, Concat, [1]]                                      # 31-cat Y4
  - [-1, 3, RepC3, [256, 0.5]]                                      # 32-pan_blocks.0
  
  # ══════════════════════════════════════════════════════════
  # ★创新点③ FullPAD_Tunnel - PAN P4旁路
  # ══════════════════════════════════════════════════════════
  - [[-1, 23], 1, FullPAD_Tunnel, []]                               # 33

  # ══════════════════════════════════════════════════════════
  # PAN下采样路径 P4→P5
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                                      # 34-downsample_convs.1
  - [[-1, 18], 1, Concat, [1]]                                      # 35-cat Y5
  - [-1, 3, RepC3, [256, 0.5]]                                      # 36-pan_blocks.1
  
  # ══════════════════════════════════════════════════════════
  # ★创新点③ FullPAD_Tunnel - PAN P5旁路
  # ══════════════════════════════════════════════════════════
  - [[-1, 18], 1, FullPAD_Tunnel, []]                               # 37

  # ══════════════════════════════════════════════════════════
  # RTDETRDecoder检测头
  # ══════════════════════════════════════════════════════════
  - [[29, 33, 37], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]       # 38-Detect(P3, P4, P5)