# RT-DETR-r18 MultiModal with WCA Encoder
# 
# 小波交叉注意力编码器多模态架构：
#   - Backbone：RGB + 红外双分支ResNet18
#   - P3融合：Concat + Conv（简单融合）
#   - Encoder：TransformerEncoderLayer_WCA（小波频域感知）
#
# ═══════════════════════════════════════════════════════════
# 架构设计理念
# ═══════════════════════════════════════════════════════════
#
# 【TransformerEncoderLayer_WCA核心机制】
#   - Haar小波分解：将特征分解为高频/低频子带
#   - MSCW门控加权：多尺度通道加权，自适应调整高低频贡献
#   - 原型注意力：捕捉频域全局依赖
#
# 【多模态适配】
#   针对RGB+红外异构频率特性：
#     - VEDAI：红外低频主导，RGB高频丰富
#     - M3FD：夜间场景高频衰减
#   WCA在P5编码器位置对融合后特征进行频域自适应处理
#
# ═══════════════════════════════════════════════════════════
# 层号索引（共34层，0-33）
# ═══════════════════════════════════════════════════════════
#
# ─── RGB分支 ───
#   0-3   RGB Stem (ConvNormLayer×3 + MaxPool)
#   4-5   RGB Stage2-3 (BasicBlock)
#   6-7   RGB Stage4-5 (BasicBlock)
#
# ─── 红外分支 ───
#   8-11  X Stem (ConvNormLayer×3 + MaxPool)
#   12-13 X Stage2-3 (BasicBlock)
#   14-15 X Stage4-5 (BasicBlock)
#
# ─── Backbone融合 ───
#   16    Concat P3 ← RGB_P3 + X_P3
#   17    Conv 融合卷积
#   18    Blocks P4/16
#   19    Blocks P5/32
#
# ─── Head ───
#   20    Conv input_proj.2
#   21    TransformerEncoderLayer_WCA  ★核心创新点
#   22    Conv Y5
#   23-33 FPN/PAN标准结构
#   34    RTDETRDecoder
#
# ═══════════════════════════════════════════════════════════

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:

  # ══════════════════════════════════════════════════════════
  # RGB分支 - ResNet18
  # ══════════════════════════════════════════════════════════
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']  # 0-P1/2 RGB输入
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]         # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]         # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                                # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                 # 4 RGB Stage2
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]                # 5-P3/8 RGB_P3 128ch
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]                # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]                # 7-P5/32

  # ══════════════════════════════════════════════════════════
  # 红外(X)分支 - ResNet18
  # ══════════════════════════════════════════════════════════
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']    # 8-P1/2 红外输入
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]         # 9
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]         # 10
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                                # 11-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                 # 12 X Stage2
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]                # 13-P3/8 X_P3 128ch
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]                # 14-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]                # 15-P5/32

  # ══════════════════════════════════════════════════════════
  # P3中层融合点（简单Concat + Conv）
  # ══════════════════════════════════════════════════════════
  # 输入：RGB_P3(层5-128ch) + X_P3(层13-128ch)
  # 输出：256ch融合特征
  - [[5, 13], 1, Concat, [1]]                                       # 16-P3/8 Concat
  - [-1, 1, Conv, [256, 1, 1]]                                      # 17-P3/8 融合卷积 256ch

  # ══════════════════════════════════════════════════════════
  # 融合后继续处理 P4/P5
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]                # 18-P4/16 256ch
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]                # 19-P5/32 512ch

head:

  # ══════════════════════════════════════════════════════════
  # Encoder部分
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 20 input_proj.2 512→256

  # ★核心创新点：TransformerEncoderLayer_WCA
  # 替换AIFI，使用小波交叉注意力进行频域自适应编码
  # 参数：[hidden_dim]
  #   - hidden_dim=1024: Transformer隐层维度
  # 机制：
  #   1. Haar小波分解 → 高频LL/低频HH/LH/HL子带
  #   2. MSCW门控 → 多尺度通道加权，自适应高低频贡献
  #   3. 原型注意力 → 捕捉频域全局依赖
  # 针对多模态频率异构：
  #   - VEDAI：红外低频/RGB高频异构 → WCA自适应平衡
  #   - M3FD：夜间高频衰减 → WCA增强高频分量
  - [-1, 1, TransformerEncoderLayer_WCA, [1024]]                    # 21 WCA编码器 256ch

  - [-1, 1, Conv, [256, 1, 1]]                                      # 22 Y5, lateral_convs.0

  # ══════════════════════════════════════════════════════════
  # FPN上采样路径
  # ══════════════════════════════════════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      # 23 P5上采样
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 24 input_proj.1 (P4)
  - [[-2, -1], 1, Concat, [1]]                                      # 25 Concat
  - [-1, 3, RepC3, [256, 0.5]]                                      # 26 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                                      # 27 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      # 28 P4上采样
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]                   # 29 input_proj.0 (融合P3)
  - [[-2, -1], 1, Concat, [1]]                                      # 30 Concat
  - [-1, 3, RepC3, [256, 0.5]]                                      # 31 X3, fpn_blocks.1

  # ══════════════════════════════════════════════════════════
  # PAN下采样路径
  # ══════════════════════════════════════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                                      # 32 downsample_convs.0
  - [[-1, 27], 1, Concat, [1]]                                      # 33 Concat Y4
  - [-1, 3, RepC3, [256, 0.5]]                                      # 34 F4, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]                                      # 35 downsample_convs.1
  - [[-1, 22], 1, Concat, [1]]                                      # 36 Concat Y5
  - [-1, 3, RepC3, [256, 0.5]]                                      # 37 F5, pan_blocks.1

  # ══════════════════════════════════════════════════════════
  # RTDETRDecoder检测头
  # ══════════════════════════════════════════════════════════
  - [[31, 34, 37], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]       # 38 Detect(P3, P4, P5)